class Users:
    user = {
        1: 'Кирилл',
        2: 'Сосницкий',
        3: 'Адрес',
        4: 'Парк культуры',
        5: '89000000000',
        6: '13.04.2025',
        7: '!!!!',
    }

    user_2 = {
        1: 'Иван',
        2: 'Иванов',
        3: 'Адрес',
        4: 'Парк культуры',
        5: '88000000000',
        6: '13.04.2025',
        7: '!!!!',
    }


class Urls:
    URL_dzen = "https://dzen.ru/?yredirect=true"
    URL_qa_scooter = "https://qa-scooter.praktikum-services.ru/"
    URL_qa_scooter_order = URL_qa_scooter + "order"
    URL_qa_scooter_track = URL_qa_scooter + "track"


class Questions:
    expected_question_text = [
            'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
            'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
            'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
            'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
            'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
            'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
            'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
            'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
    ]
